---
kind: other
id: Properties.T:Autodesk.Revit.DB.FailureResolution
source: html/7970d597-562c-6888-2073-1247d0d10e50.htm
---
# FailureResolution Properties

Specifies whether the .NET object represents a valid Revit entity.